INSERT INTO subscriber (name, address)
VALUES
    ('Флойд Мейвезер', 'Где-то на Луне, далеко-далеко...'),
    ('Иван Иванов', 'Москва, ул. Ленина, д. 1'),
    ('Мария Петрова', 'Санкт-Петербург, ул. Пушкина, д. 10'),
    ('Алексей Смирнов', 'Новосибирск, ул. Гагарина, д. 5'),
    ('Александр Сергеев', 'Где-то на съемках Саша-Таня');

INSERT INTO phone_number (number, subscriber)
VALUES
    ('912342184536', 1),
    ('111029343956', 2),
    ('122113545699', 2),
    ('955478385839', 3),
    ('464657359595', 3);

INSERT INTO dialing_code (country_code, country_name)
VALUES
    ('81', 'USA'),
    ('RUS', 'Russia'),
    ('+7', 'Russia'),
    ('MIA', 'Italy'),
    ('999', 'Moon');

INSERT INTO payphone (location)
VALUES
    ('Луна, где-то стоит на луне'),
    ('США, дом Флойда Мейвезера'),
    ('Лондон, где-то около Тауэра'),
    ('Кремль'),
    ('ИТМО, кабинет ректора'),
    ('Китайская забегаловка на Большой Лубянке'),
    ('Основание статуи Ленина на площади 1905 года в Екатеринбурге');

INSERT INTO credit_token (token_type)
VALUES
    ('Универсальный'),
    ('Специальный'),
    ('Экспресс'),
    ('Для правительственной связи'),
    ('Международный');

INSERT INTO call (to_number, dialing_code, payphone, token, call_duration)
VALUES
    ('934245634512', '81', 1, 1, 3600),
    ('894322716459', 'RUS', 4, 4, 100),
    ('894322716459', 'RUS', 3, 4, 10000000),
    ('818111294536', 'MIA', 6, 3, 15634),
    ('888324563956', '999', 2, 1, 3600);

INSERT INTO subscriber_credit_token (subscriber_id, token_id)
VALUES
    (1, 1),
    (2, 4),
    (2, 3),
    (3, 1),
    (4, 3);

