-- Первое задание
SELECT "Н_ОЦЕНКИ"."КОД", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
FROM "Н_ОЦЕНКИ"
         LEFT JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ОЦЕНКА" = "Н_ОЦЕНКИ"."КОД"
WHERE "Н_ОЦЕНКИ"."ПРИМЕЧАНИЕ" > 'освобождение'
  AND "Н_ВЕДОМОСТИ"."ИД" > 1250972;

-- Второе задание
SELECT "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "Н_СЕССИЯ"."ИД"
FROM "Н_ЛЮДИ"
         RIGHT JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
         RIGHT JOIN "Н_СЕССИЯ" ON "Н_ВЕДОМОСТИ"."СЭС_ИД" = "Н_СЕССИЯ"."СЭС_ИД"
WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" > 'Соколов'
  AND "Н_ВЕДОМОСТИ"."ИД" = 1250981
  AND "Н_СЕССИЯ"."ЧЛВК_ИД" = 100622;
