-- Первое задание
SELECT "Н_ОЦЕНКИ"."КОД", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
FROM "Н_ОЦЕНКИ"
         LEFT JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ОЦЕНКА" = "Н_ОЦЕНКИ"."КОД"
WHERE "Н_ОЦЕНКИ"."ПРИМЕЧАНИЕ" > 'освобождение'
  AND "Н_ВЕДОМОСТИ"."ИД" > 1250972;

-- Второе задание
SELECT "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "Н_СЕССИЯ"."ИД"
FROM "Н_ЛЮДИ"
         RIGHT JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
         RIGHT JOIN "Н_СЕССИЯ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" > 'Соколов'
  AND "Н_ВЕДОМОСТИ"."ИД" = 1250981
  AND "Н_СЕССИЯ"."ЧЛВК_ИД" = 100622;

-- Третье задание
SELECT COUNT(*)
FROM "Н_ЛЮДИ"
         JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
WHERE "Н_УЧЕНИКИ"."ГРУППА" = '3102'
  AND "Н_ЛЮДИ"."ИНН" IS NULL;

-- Четвертое задание
SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", COUNT(*) AS Количество
FROM "Н_ЛЮДИ"
         JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
         JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
WHERE "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
GROUP BY "Н_ЛЮДИ"."ОТЧЕСТВО"
HAVING COUNT(*) < 10;

-- Пятое задание
SELECT "Н_УЧЕНИКИ"."ГРУППА",
       AVG(EXTRACT(YEAR FROM AGE(CURRENT_DATE, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))::INT AS Средний_возраст
FROM "Н_ЛЮДИ"
         JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
GROUP BY "Н_УЧЕНИКИ"."ГРУППА"
HAVING AVG(EXTRACT(YEAR FROM AGE(CURRENT_DATE, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))) <
       (SELECT MAX(EXTRACT(YEAR FROM AGE(CURRENT_DATE, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))
        FROM "Н_ЛЮДИ"
                 JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
        WHERE "Н_УЧЕНИКИ"."ГРУППА" = '1100');

-- Шестое задание
SELECT "Н_УЧЕНИКИ"."ГРУППА",
       "Н_ЛЮДИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       "Н_УЧЕНИКИ"."В_СВЯЗИ_С"
FROM "Н_ЛЮДИ",
     "Н_УЧЕНИКИ"
WHERE "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
  AND "Н_УЧЕНИКИ"."ПРИЗНАК" = 'отчисл'
  AND DATE("Н_УЧЕНИКИ"."КОНЕЦ") = DATE '2012-09-01'
  AND "ПЛАН_ИД" IN (SELECT "ИД"
                    FROM "Н_ПЛАНЫ"
                    WHERE "ФО_ИД" IN (SELECT "ИД"
                                      FROM "Н_ФОРМЫ_ОБУЧЕНИЯ"
                                      WHERE "НАИМЕНОВАНИЕ" = 'Очная')
                      AND "НАПС_ИД" IN (SELECT "ИД"
                                        FROM "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"
                                        WHERE "НС_ИД" IN (SELECT "ИД"
                                                          FROM "Н_НАПР_СПЕЦ"
                                                          WHERE "НАИМЕНОВАНИЕ" = 'Программная инженерия')));